{
    "navbar": {
        "home": "Home",
        "about": "About",
        "skills": "Skills",
        "projects": "Projects",
        "contact": "Contact"
    },
    "portfolio": {
        "title": "Full-Stack Developer",
        "resume": "I'm a full-stack developer with over five years of experience working with a variety of technologies, including JavaScript, Node.js, Express.js, NestJS, Next.js, Angular, React, Java, Spring Boot, Python, and Django. I also have experience in other languages ​​such as PHP and C#, which, combined with my experience, allows me to quickly integrate into teams working with frameworks like Laravel or .NET.",
        "technologies": "Technologies that I master",
        "projects": "Featured projects",
        "projectsAbput": "Learn more about the projects I have developed.",
        "seeProjects": "See projects"
    },
    "footer": {
        "rights": "All rights reserved"
    },
    "about": {
        "me": "I am a full-stack developer with over five years of experience developing RESTful APIs and web applications. Since high school, I discovered a passion for computing, especially programming, which motivated me to study Computer Systems Engineering, culminating in my degree as an engineer. I am currently seeking new professional challenges where I can continue to grow and contribute value.",
        "experience": "Experience",
        "experieciaText": "Throughout my career, I've participated in numerous projects using agile methodologies such as Scrum and Kanban, collaborating on multidisciplinary teams. My main contributions include:",
        "goals": [
            "Development of secure and efficient RESTful APIs with frameworks such as Node.js, Express.js, NestJS, Spring Boot, and Django.",
            "Creation of responsive websites with Angular, React, Next.js, and previous experience with AngularJS.",
            "Styled using CSS, SCSS, and libraries such as Bootstrap and Angular Material.",
            "Integration of external services using GraphQL, JSON, and XML.",
            "Optimization of systems and endpoints, achieving significant improvements in response times.",
            "Implementation of security measures such as JWT and CORS management."
        ],
        "skills": [
            "Effective communication",
            "Teamwork",
            "Troubleshooting",
            "Critical thinking",
            "Adaptability",
            "Emotional intelligence"
        ],
        "goalsTitle": "Values and goals",
        "goalsText": "I consider myself an honest, responsible, persistent, respectful, and adaptable person. My goal is to continue developing personally and professionally, staying up-to-date on new technologies, and contributing to the success of the projects I participate in with commitment and quality.",
        "workPhilosophy": "Work philosophy",
        "workPhilosophyText": "I firmly believe in the power of collaborative work, continuous improvement, and professional accountability. I strive to write clean code, maintain best practices, and document my solutions so others can build upon them. I value open communication, constant learning, and a commitment to delivering real value with each iteration. For me, technology is not just a tool, but a means to transform ideas into solutions that positively impact people."
    },
    "skills": {
        "hardSkills": "Hard skills",
        "programmingLanguages": "Programming languages",
        "programmingLanguagesText": "Soy consciente de que existen otros lenguajes especializados, como Kotlin, Swift o Dart para desarrollo móvil, así como modernos como Go para sistemas distribuidos. Aunque aún no los he utilizado profesionalmente, me entusiasma seguir aprendiendo y me encantaría profundizar en ellos para ampliar mis capacidades como desarrollador.",
        "frameworks": "Frameworks and libraries",
        "frameworksText": "Estoy seguro de que podría adaptarme fácilmente a entornos basados en otras tecnologías como Laravel, Symfony, .NET o Vue.js, ya que disfruto el reto de aprender y enfrentarme a nuevos lenguajes y herramientas.",
        "dataBases": "Data bases",
        "tools": "Tools",
        "styles": "Styles / UI",
        "softSkills": "Soft skills"
    },
    "projects": {
        "professionalProjects": "Professional projects",
        "projectsText": "Estos son algunos de los proyectos en los que he participado a lo largo de mi carrera profesional. Todos fueron desarrollados para clientes reales y llevados a producción, aplicando buenas prácticas de desarrollo, seguridad y rendimiento. Por razones de confidencialidad, no puedo compartir el código fuente públicamente, ya que pertenece a los respectivos propietarios. Sin embargo, estoy trabajando en una sección de Proyectos personales, donde sí podré mostrar el código y explicar en detalle las soluciones implementadas.",
        "translations": {
            "description": "Description",
            "technologies": "Technologies",
            "challenges": "Challenges"
        },
        "jvp": {
            "description": "Secure ride-hailing company",
            "activities": [
                "Agregué nuevos endpoints en el servidor para atender requerimientos específicos",
                "Optimicé alrededor de 20 endpoints existentes, mejorando su rendimiento y eficiencia",
                "Diagnostiqué y corregí  errores visuales y funcionales en el sitio web mejorando la experiencia del usuario",
                "Construí un nuevo sitio web, donde los usuarios pueden solicitar nuevos viajes."
            ]
        },
        "iloveat": {
            "description": " Mexican food online store",
            "activities": [
                "Diseñé e implementé una base de datos en MongoDB",
                "Desarrollé un servidor web con Node.js y Express creando los endpoints necesarios",
                "Integré servicios como Conekta para pagos en línea y Mailchimp para el envío automatizado de correos",
                "Creé un sitio web donde los usuarios pueden gestionar sus cuentas, explorar el catálogo, realizar órdenes de compra y monitorear su estatus"
            ]
        },
        "carlogic": {
            "description": "Imports and logistics",
            "activities": [
                "Optimicé varios endpoints que realizan consultas SQL lo cual mejoró la velocidad hasta el 90%.",
                "Integré la plataforma de Monday para crear y actualizar registros en varios tableros usando GraphQL.",
                "Migré una aplicación web de AngularJS a la última versión de Angular para garantizar mayor rendimiento."
            ]
        },
        "cxteam":{
            "description": "Sistema de encuestas",
            "activities": [
                "Desarrolle un sitio web donde los usuarios pueden generar encuestas, usando un sistema de bloques (con la ayuda de la librería Drawflow).",
                "Construí un simulador de una pantalla de tableta, para que los usuarios puedan visualizar las encuestas finales.",
                "Incorporé varias de las herramientas de la plataforma Firebase como lo son Realtime Database para monitorear en tiempo real los dispositivos que participan en las encuestas, Authentication para permitir que solo usuarios autorizados puedan ingresar al sistema y Cloud Functions para ejecutar código backend en respuesta a eventos (crear, modificar y eliminar) un documento en Firestore."
            ]
        },
        "rocket": {
            "description": "Order shipment system",
            "activities": [
                "Desarrollé un servidor web que se conecta a los servicios de paqueterías como  FedEx, RedPack y Estafeta para crear y monitorear envíos para posteriormente actualizar la información en una base de datos.",
                "Creé dos páginas una donde los usuarios pueden realizar las diferentes operaciones del flujo del sistema y otra informativa donde los clientes pueden conocer la empresa y además ponerse en contacto con ellos.",
                "Diseñe e implemente un sistema reutilizable donde  se pueden actualizar varios registros a la vez a través de archivos csv."
            ]
        },
        "yacht": {
            "description": "Yacht Rental Catalog",
            "activities": [
                "Diseñé y desarrollé una API RESTful para gestionar el catálogo de yates, implementando autenticación basada en JWT. La API fue consumida por el frontend y conectada a una base de datos para almacenar la información del catálogo.",
                "Construí un portal usando React para explorar y rentar yates, asegurando un diseño responsivo y una experiencia accesible en todos los dispositivos."
            ]
        },
        "tickets": {
            "description": "Sistema de Gestión de Tickets",
            "activities": [
                "Desarrollé un sistema completo de gestión de tickets para soporte técnico. Permitía a los usuarios registrar incidencias, dar seguimiento a sus solicitudes y recibir actualizaciones por parte del equipo de soporte.",
                "Incluí funcionalidades de autenticación, panel administrativo, control de estados de tickets (abierto, en proceso, cerrado), y notificaciones."
            ]
        },
        "vanvien": {
            "description": "Calzado industrial",
            "activities": [
                "Diseñé y desarrollé una API RESTful para gestionar la actualización de datos en SQL Server, incluyendo la creación y optimización de varias tablas"
            ]
        },
        "others": {
            "description": "Pequeños proyectos en los que he trabajado",
            "activities": [
                "Programé aplicaciones de escritorio con Electron.js para automatizar procesos en un servidor de Windows.",
                "Elaboré una aplicación en Python para realizar consultas y actualizaciones en una base de datos Firebird y gestionar información en Monday.com.",
                "Construí varios sitios web pequeños utilizando tecnologías como React.js y Angular, adaptándome a las necesidades específicas de cada proyecto.",
                "Realicé la migración de múltiples endpoints desde un servidor desarrollado en Laravel hacia una nueva arquitectura basada en Express.js, asegurando la compatibilidad y el correcto funcionamiento de las funcionalidades existentes.",
                "Elabore varios endpoints en una RESTful API construida en Django."
            ]
        }
    }
}