{
    "navbar": {
        "home": "Home",
        "about": "About",
        "skills": "Skills",
        "projects": "Projects",
        "contact": "Contact"
    },
    "portfolio": {
        "title": "Full-Stack Developer",
        "resume": "I'm a full-stack developer with over five years of experience working with a variety of technologies, including JavaScript, Node.js, Express.js, NestJS, Next.js, Angular, React, Java, Spring Boot, Python, and Django. I also have experience in other languages ​​such as PHP and C#, which, combined with my experience, allows me to quickly integrate into teams working with frameworks like Laravel or .NET.",
        "technologies": "Technologies that I master",
        "projects": "Featured projects",
        "projectsAbput": "Learn more about the projects I have developed.",
        "seeProjects": "See projects"
    },
    "footer": {
        "rights": "All rights reserved"
    },
    "about": {
        "me": "I am a full-stack developer with over five years of experience developing RESTful APIs and web applications. Since high school, I discovered a passion for computing, especially programming, which motivated me to study Computer Systems Engineering, culminating in my degree as an engineer. I am currently seeking new professional challenges where I can continue to grow and contribute value.",
        "experience": "Experience",
        "experieciaText": "Throughout my career, I've participated in numerous projects using agile methodologies such as Scrum and Kanban, collaborating on multidisciplinary teams. My main contributions include:",
        "goals": [
            "Development of secure and efficient RESTful APIs with frameworks such as Node.js, Express.js, NestJS, Spring Boot, and Django.",
            "Creation of responsive websites with Angular, React, Next.js, and previous experience with AngularJS.",
            "Styled using CSS, SCSS, and libraries such as Bootstrap and Angular Material.",
            "Integration of external services using GraphQL, JSON, and XML.",
            "Optimization of systems and endpoints, achieving significant improvements in response times.",
            "Implementation of security measures such as JWT and CORS management."
        ],
        "skills": [
            "Effective communication",
            "Teamwork",
            "Troubleshooting",
            "Critical thinking",
            "Adaptability",
            "Emotional intelligence"
        ],
        "goalsTitle": "Values and goals",
        "goalsText": "I consider myself an honest, responsible, persistent, respectful, and adaptable person. My goal is to continue developing personally and professionally, staying up-to-date on new technologies, and contributing to the success of the projects I participate in with commitment and quality.",
        "workPhilosophy": "Work philosophy",
        "workPhilosophyText": "I firmly believe in the power of collaborative work, continuous improvement, and professional accountability. I strive to write clean code, maintain best practices, and document my solutions so others can build upon them. I value open communication, constant learning, and a commitment to delivering real value with each iteration. For me, technology is not just a tool, but a means to transform ideas into solutions that positively impact people."
    },
    "skills": {
        "hardSkills": "Hard skills",
        "programmingLanguages": "Programming languages",
        "programmingLanguagesText": "Soy consciente de que existen otros lenguajes especializados, como Kotlin, Swift o Dart para desarrollo móvil, así como modernos como Go para sistemas distribuidos. Aunque aún no los he utilizado profesionalmente, me entusiasma seguir aprendiendo y me encantaría profundizar en ellos para ampliar mis capacidades como desarrollador.",
        "frameworks": "Frameworks and libraries",
        "frameworksText": "Estoy seguro de que podría adaptarme fácilmente a entornos basados en otras tecnologías como Laravel, Symfony, .NET o Vue.js, ya que disfruto el reto de aprender y enfrentarme a nuevos lenguajes y herramientas.",
        "dataBases": "Databases",
        "tools": "Tools",
        "styles": "Styling / UI",
        "softSkills": "Soft skills"
    },
    "projects": {
        "professionalProjects": "Professional Projects",
        "projectsText": "A selection of professional projects I’ve worked on. All were built for real clients and deployed to production following best practices. Due to confidentiality, the source code can't be shared.",
        "translations": {
            "description": "Description",
            "technologies": "Technologies",
            "challenges": "Challenges"
        },
        "jvp": {
            "description": "Secure ride-hailing company",
            "activities": [
                "Added new endpoints on the server to meet specific requirements",
                "Optimized around 20 existing endpoints, improving performance and efficiency",
                "Diagnosed and fixed visual and functional bugs on the website to improve user experience",
                "Built a new website where users can request new rides"
            ]
        },
        "iloveat": {
            "description": "Mexican food online store",
            "activities": [
                "Designed and implemented a MongoDB database",
                "Developed a web server with Node.js and Express, creating the necessary endpoints",
                "Integrated services such as Conekta for online payments and Mailchimp for automated email delivery",
                "Created a website where users can manage their accounts, explore the catalog, place purchase orders, and track their status"
            ]
        },
        "carlogic": {
            "description": "Imports and logistics",
            "activities": [
                "Optimized several SQL query endpoints, improving speed by up to 90%",
                "Integrated the Monday platform to create and update records across various boards using GraphQL",
                "Migrated a web application from AngularJS to the latest version of Angular to ensure better performance"
            ]
        },
        "cxteam": {
            "description": "Survey system",
            "activities": [
                "Developed a website where users can generate surveys using a block-based system (with the help of the Drawflow library)",
                "Built a tablet-screen simulator to allow users to preview the final surveys",
                "Integrated several Firebase tools, such as Realtime Database to monitor in real-time the devices participating in surveys, Authentication to allow only authorized users to access the system, and Cloud Functions to run backend code in response to events (create, update, and delete) in Firestore"
            ]
        },
        "rocket": {
            "description": "Order shipment system",
            "activities": [
                "Developed a web server that connects to parcel services like FedEx, RedPack, and Estafeta to create and monitor shipments, then updates the information in a database",
                "Created two pages: one where users can perform various operations of the system flow, and another informative one where clients can learn about the company and get in touch",
                "Designed and implemented a reusable system to update multiple records at once using CSV files"
            ]
        },
        "yacht": {
            "description": "Yacht Rental Catalog",
            "activities": [
                "Designed and developed a RESTful API to manage the yacht catalog, implementing JWT-based authentication. The API was consumed by the frontend and connected to a database to store catalog information",
                "Built a portal using React to browse and rent yachts, ensuring a responsive design and accessible experience on all devices"
            ]
        },
        "tickets": {
            "description": "Ticket Management System",
            "activities": [
                "Developed a complete ticket management system for technical support. It allowed users to register issues, track their requests, and receive updates from the support team",
                "Included authentication features, an admin panel, ticket status control (open, in progress, closed), and notifications"
            ]
        },
        "vanvien": {
            "description": "Industrial footwear",
            "activities": [
                "Designed and developed a RESTful API to manage data updates in SQL Server, including the creation and optimization of several tables"
            ]
        },
        "others": {
            "description": "Small projects I have worked on",
            "activities": [
                "Developed desktop applications with Electron.js to automate processes on a Windows server",
                "Built a Python application to perform queries and updates in a Firebird database and manage data in Monday.com",
                "Created several small websites using technologies like React.js and Angular, adapting to the specific needs of each project",
                "Migrated multiple endpoints from a Laravel-based server to a new Express.js-based architecture, ensuring compatibility and proper functionality of existing features",
                "Developed several endpoints in a RESTful API built with Django"
            ]
        }
    },
    "contact": {
        "contactText": "Are you interested in working with me or do you have any questions? Don't hesitate to write to me or visit my professional networks."
    }
}