{
    "navbar": {
        "home": "Home",
        "about": "About",
        "skills": "Skills",
        "projects": "Projects",
        "contact": "Contact"
    },
    "portfolio": {
        "title": "Full-Stack Developer",
        "resume": "I'm a full-stack developer with over five years of experience working with a variety of technologies, including JavaScript, Node.js, Express.js, NestJS, Next.js, Angular, React, Java, Spring Boot, Python, and Django. I also have experience in other languages ​​such as PHP and C#, which, combined with my experience, allows me to quickly integrate into teams working with frameworks like Laravel or .NET.",
        "technologies": "Technologies that I master",
        "projects": "Featured projects",
        "projectsAbput": "Learn more about the projects I have developed.",
        "seeProjects": "See projects"
    },
    "footer": {
        "rights": "All rights reserved"
    },
    "about": {
        "me": "I am a full-stack developer with over five years of experience developing RESTful APIs and web applications. Since high school, I discovered a passion for computing, especially programming, which motivated me to study Computer Systems Engineering, culminating in my degree as an engineer. I am currently seeking new professional challenges where I can continue to grow and contribute value.",
        "experience": "Experience",
        "experieciaText": "Throughout my career, I've participated in numerous projects using agile methodologies such as Scrum and Kanban, collaborating on multidisciplinary teams. My main contributions include:",
        "goals": [
            "Development of secure and efficient RESTful APIs with frameworks such as Node.js, Express.js, NestJS, Spring Boot, and Django.",
            "Creation of responsive websites with Angular, React, Next.js, and previous experience with AngularJS.",
            "Styled using CSS, SCSS, and libraries such as Bootstrap and Angular Material.",
            "Integration of external services using GraphQL, JSON, and XML.",
            "Optimization of systems and endpoints, achieving significant improvements in response times.",
            "Implementation of security measures such as JWT and CORS management."
        ],
        "skills": [
            "Effective communication",
            "Teamwork",
            "Troubleshooting",
            "Critical thinking",
            "Adaptability",
            "Emotional intelligence"
        ],
        "goalsTitle": "Values and goals",
        "goalsText": "I consider myself an honest, responsible, persistent, respectful, and adaptable person. My goal is to continue developing personally and professionally, staying up-to-date on new technologies, and contributing to the success of the projects I participate in with commitment and quality.",
        "workPhilosophy": "Work philosophy",
        "workPhilosophyText": "I firmly believe in the power of collaborative work, continuous improvement, and professional accountability. I strive to write clean code, maintain best practices, and document my solutions so others can build upon them. I value open communication, constant learning, and a commitment to delivering real value with each iteration. For me, technology is not just a tool, but a means to transform ideas into solutions that positively impact people."
    },
    "skills": {
        "hardSkills": "Hard skills",
        "programmingLanguages": "Programming languages",
        "programmingLanguagesText": "Soy consciente de que existen otros lenguajes especializados, como Kotlin, Swift o Dart para desarrollo móvil, así como modernos como Go para sistemas distribuidos. Aunque aún no los he utilizado profesionalmente, me entusiasma seguir aprendiendo y me encantaría profundizar en ellos para ampliar mis capacidades como desarrollador.",
        "frameworks": "Frameworks and libraries",
        "frameworksText": "Estoy seguro de que podría adaptarme fácilmente a entornos basados en otras tecnologías como Laravel, Symfony, .NET o Vue.js, ya que disfruto el reto de aprender y enfrentarme a nuevos lenguajes y herramientas.",
        "dataBases": "Data bases",
        "tools": "Tools",
        "styles": "Styles / UI",
        "softSkills": "Soft skills"
    }
}