{
    "navbar": {
        "home": "Inicio",
        "about": "Sobre mí",
        "skills": "Habilidades",
        "projects": "Proyectos",
        "contact": "Contacto"
    },
    "portfolio": {
        "title": "Desarrollador Full-Stack",
        "resume": "Soy desarrollador full-stack con más de cinco años de experiencia trabajando con diversas tecnologías, entre ellas: JavaScript, Node.js, Express.js, NestJS, Next.js, Angular, React, Java, Spring Boot, Python y Django. También tengo conocimientos en otros lenguajes como PHP y C#, lo que, sumado a mi experiencia, me permite integrarme rápidamente a equipos que trabajen con frameworks como Laravel o .NET.",
        "technologies": "Tecnologías que domino",
        "projects": "Proyectos destacados",
        "projectsAbput": "Conoce más sobre los proyectos que he desarrollado.",
        "seeProjects": "Ver proyectos"
    },
    "footer": {
        "rights": "Todos los derechos reservados"
    },
    "about": {
        "me": "Soy un desarrollador Full-Stack con más de cinco años de experiencia en el desarrollo de APIs RESTful y aplicaciones web. Desde el bachillerato descubrí una pasión por la computación, especialmente por la programación, lo que me motivó a estudiar la carrera de Ingeniería en Sistemas Computacionales, culminando con mi graduación como ingeniero. Actualmente me encuentro en búsqueda de nuevos retos profesionales donde pueda seguir creciendo y aportando valor.",
        "experience": "Experiecia",
        "experieciaText": "A lo largo de mi trayectoria he participado en múltiples proyectos bajo metodologías ágiles como Scrum y Kanban, colaborando en equipos multidisciplinarios. Entre mis principales aportaciones se encuentran:",
        "goals": [
            "Desarrollo de APIs RESTful seguras y eficientes con frameworks como Node.js, Express.js, NestJS, Spring Boot y Django.",
            "Creación de sitios web responsivos con Angular, React, Next.js y experiencia previa con AngularJS.",
            "Estilización usando CSS, SCSS y librerías como Bootstrap y Angular Material.",
            "Integración de servicios externos mediante GraphQL, JSON y XML.",
            "Optimización de sistemas y endpoints, logrando una mejora significativa en tiempos de respuesta.",
            "Implementación de medidas de seguridad como JWT y gestión de CORS."
        ],
        "skills": [
            "Comunicación efectiva",
            "Trabajo en equipo",
            "Resolución de problemas",
            "Pensamiento crítico",
            "Adaptabilidad",
            "Inteligencia emocional"
        ],
        "goalsTitle": "Valores y metas",
        "goalsText": "Me considero una persona honesta, responsable, persistente, respetuosa y adaptable.Mi meta es seguir desarrollándome a nivel personal y profesional, manteniéndome actualizado en nuevas tecnologías, y contribuyendo al éxito de los proyectos en los que participo con compromiso y calidad.",
        "workPhilosophy": "Filosofía de trabajo",
        "workPhilosophyText": "Creo firmemente en el poder del trabajo colaborativo, la mejora continua y la responsabilidad profesional. Me esfuerzo por escribir código limpio, mantener buenas prácticas y documentar mis soluciones para que otros puedan construir sobre ellas. Valoro la comunicación abierta, el aprendizaje constante y el compromiso con entregar valor real en cada iteración. Para mí, la tecnología no es solo una herramienta, sino un medio para transformar ideas en soluciones que impacten positivamente a las personas."
    },
    "skills": {
        "hardSkills": "Habilidades Técnicas",
        "programmingLanguages": "Lenguajes de programación",
        "programmingLanguagesText": "Soy consciente de que existen otros lenguajes especializados, como Kotlin, Swift o Dart para desarrollo móvil, así como modernos como Go para sistemas distribuidos. Aunque aún no los he utilizado profesionalmente, me entusiasma seguir aprendiendo y me encantaría profundizar en ellos para ampliar mis capacidades como desarrollador.",
        "frameworks": "Frameworks y bibliotecas",
        "frameworksText": "Estoy seguro de que podría adaptarme fácilmente a entornos basados en otras tecnologías como Laravel, Symfony, .NET o Vue.js, ya que disfruto el reto de aprender y enfrentarme a nuevas herramientas.",
        "dataBases": "Bases de datos",
        "tools": "Herramientas y tecnologías",
        "styles": "Estilos / UI",
        "softSkills": "Habilidades Blandas"
    },
    "projects": {
        "professionalProjects": "Proyectos profesionales",
        "projectsText": "Algunos de los proyectos en los que he trabajado profesionalmente. Fueron desarrollados para clientes reales y llevados a producción, aplicando buenas prácticas. Por confidencialidad, no puedo compartir el código fuente.",
        "translations": {
            "description": "Descripción",
            "technologies": "Tecnologías",
            "challenges": "Retos enfrentados"
        },
        "jvp": {
            "description": "Empresa de transporte seguro",
            "activities": [
                "Agregué nuevos endpoints en el servidor para atender requerimientos específicos.",
                "Optimicé alrededor de 20 endpoints existentes, mejorando su rendimiento y eficiencia.",
                "Diagnostiqué y corregí  errores visuales y funcionales en el sitio web mejorando la experiencia del usuario.",
                "Construí un nuevo sitio web, donde los usuarios pueden solicitar nuevos viajes.",
                "Integré funcionalidades de Google Maps como Autocomplete."
            ]
        },
        "iloveat": {
            "description": "Tienda online de comida mexicana",
            "activities": [
                "Diseñé e implementé una base de datos en MongoDB.",
                "Desarrollé un servidor web con Node.js y Express creando los endpoints necesarios.",
                "Integré medidas de seguridad, incluyendo autenticación con tokens JWT.",
                "Integré servicios como Conekta para pagos en línea y Mailchimp para el envío automatizado de correos.",
                "Creé un sitio web donde los usuarios pueden gestionar sus cuentas, explorar el catálogo, realizar órdenes de compra y monitorear su estatus.",
                "Agregué autenticación con Google y Facebook usando OAuth."
            ]
        },
        "carlogic": {
            "description": "Importaciones y logística",
            "activities": [
                "Optimicé varios endpoints que realizan consultas SQL lo cual mejoró la velocidad hasta el 90%.",
                "Integré la plataforma de Monday para crear y actualizar registros en varios tableros usando GraphQL.",
                "Migré una aplicación web de AngularJS a la última versión de Angular para garantizar mayor rendimiento."
            ]
        },
        "cxteam":{
            "description": "Sistema de encuestas",
            "activities": [
                "Desarrollé un sitio web donde los usuarios pueden generar encuestas, usando un sistema de bloques (con la ayuda de la librería Drawflow).",
                "Construí un simulador de una pantalla de tableta, para que los usuarios puedan visualizar las encuestas finales.",
                "Incorporé varias de las herramientas de la plataforma Firebase como lo son Realtime Database para monitorear en tiempo real los dispositivos que participan en las encuestas, Authentication para permitir que solo usuarios autorizados puedan ingresar al sistema y Cloud Functions para ejecutar código backend en respuesta a eventos (crear, modificar y eliminar) un documento en Firestore."
            ]
        },
        "rocket": {
            "description": "Sistema de envío de pedidos",
            "activities": [
                "Desarrollé un servidor web que se conecta a los servicios de paqueterías como  FedEx, RedPack y Estafeta para crear y monitorear envíos para posteriormente actualizar la información en una base de datos.",
                "Creé dos páginas una donde los usuarios pueden realizar las diferentes operaciones del flujo del sistema y otra informativa donde los clientes pueden conocer la empresa y además ponerse en contacto con ellos.",
                "Diseñe e implemente un sistema reutilizable donde  se pueden actualizar varios registros a la vez a través de archivos csv."
            ]
        },
        "yacht": {
            "description": "Catálogo de alquiler de yates",
            "activities": [
                "Diseñé y desarrollé una API RESTful para gestionar el catálogo de yates, implementando autenticación basada en JWT. La API fue consumida por el frontend y conectada a una base de datos para almacenar la información del catálogo.",
                "Construí un portal usando React para explorar y rentar yates, asegurando un diseño responsivo y una experiencia accesible en todos los dispositivos."
            ]
        },
        "tickets": {
            "description": "Sistema de Gestión de Tickets",
            "activities": [
                "Desarrollé un sistema completo de gestión de tickets para soporte técnico. Permitía a los usuarios registrar incidencias, dar seguimiento a sus solicitudes y recibir actualizaciones por parte del equipo de soporte.",
                "Incluí funcionalidades de autenticación, panel administrativo, control de estados de tickets (abierto, en proceso, cerrado), y notificaciones."
            ]
        },
        "vanvien": {
            "description": "Calzado industrial",
            "activities": [
                "Diseñé y desarrollé una API RESTful para gestionar la actualización de datos en SQL Server, incluyendo la creación y optimización de varias tablas"
            ]
        },
        "others": {
            "description": "Pequeños proyectos en los que he trabajado",
            "activities": [
                "Programé aplicaciones de escritorio con Electron.js para automatizar procesos en un servidor de Windows.",
                "Elaboré una aplicación en Python para realizar consultas y actualizaciones en una base de datos Firebird y gestionar información en Monday.com.",
                "Construí varios sitios web pequeños utilizando tecnologías como React.js y Angular, adaptándome a las necesidades específicas de cada proyecto.",
                "Realicé la migración de múltiples endpoints desde un servidor desarrollado en Laravel hacia una nueva arquitectura basada en Express.js, asegurando la compatibilidad y el correcto funcionamiento de las funcionalidades existentes.",
                "Elabore varios endpoints en una RESTful API construida en Django."
            ]
        }
    },
    "contact": {
        "contactText": "¿Te interesa trabajar conmigo o tienes alguna pregunta? No dudes en escribirme o visitar mis redes profesionales."
    }
}