{
    "navbar": {
        "home": "Inicio",
        "about": "Sobre mí",
        "skills": "Habilidades",
        "projects": "Proyectos",
        "contact": "Contacto"
    },
    "portfolio": {
        "title": "Desarrollador Full-Stack",
        "resume": "Soy desarrollador full-stack con más de cinco años de experiencia trabajando con diversas tecnologías, entre ellas: JavaScript, Node.js, Express.js, NestJS, Next.js, Angular, React, Java, Spring Boot, Python y Django. También tengo conocimientos en otros lenguajes como PHP y C#, lo que, sumado a mi experiencia, me permite integrarme rápidamente a equipos que trabajen con frameworks como Laravel o .NET.",
        "technologies": "Tecnologías que domino",
        "projects": "Proyectos destacados",
        "projectsAbput": "Conoce más sobre los proyectos que he desarrollado.",
        "seeProjects": "Ver proyectos"
    },
    "footer": {
        "rights": "Todos los derechos reservados"
    },
    "about": {
        "me": "Soy un desarrollador Full-Stack con más de cinco años de experiencia en el desarrollo de APIs RESTful y aplicaciones web. Desde el bachillerato descubrí una pasión por la computación, especialmente por la programación, lo que me motivó a estudiar la carrera de Ingeniería en Sistemas Computacionales, culminando con mi graduación como ingeniero. Actualmente me encuentro en búsqueda de nuevos retos profesionales donde pueda seguir creciendo y aportando valor.",
        "experience": "Experiecia",
        "experieciaText": "A lo largo de mi trayectoria he participado en múltiples proyectos bajo metodologías ágiles como Scrum y Kanban, colaborando en equipos multidisciplinarios. Entre mis principales aportaciones se encuentran:",
        "goals": [
            "Desarrollo de APIs RESTful seguras y eficientes con frameworks como Node.js, Express.js, NestJS, Spring Boot y Django.",
            "Creación de sitios web responsivos con Angular, React, Next.js y experiencia previa con AngularJS.",
            "Estilización usando CSS, SCSS y librerías como Bootstrap y Angular Material.",
            "Integración de servicios externos mediante GraphQL, JSON y XML.",
            "Optimización de sistemas y endpoints, logrando una mejora significativa en tiempos de respuesta.",
            "Implementación de medidas de seguridad como JWT y gestión de CORS."
        ],
        "skills": [
            "Comunicación efectiva",
            "Trabajo en equipo",
            "Resolución de problemas",
            "Pensamiento crítico",
            "Adaptabilidad",
            "Inteligencia emocional"
        ],
        "goalsTitle": "Valores y metas",
        "goalsText": "Me considero una persona honesta, responsable, persistente, respetuosa y adaptable.Mi meta es seguir desarrollándome a nivel personal y profesional, manteniéndome actualizado en nuevas tecnologías, y contribuyendo al éxito de los proyectos en los que participo con compromiso y calidad.",
        "workPhilosophy": "Filosofía de trabajo",
        "workPhilosophyText": "Creo firmemente en el poder del trabajo colaborativo, la mejora continua y la responsabilidad profesional. Me esfuerzo por escribir código limpio, mantener buenas prácticas y documentar mis soluciones para que otros puedan construir sobre ellas. Valoro la comunicación abierta, el aprendizaje constante y el compromiso con entregar valor real en cada iteración. Para mí, la tecnología no es solo una herramienta, sino un medio para transformar ideas en soluciones que impacten positivamente a las personas."
    },
    "skills": {
        "hardSkills": "Habilidades Técnicas",
        "programmingLanguages": "Lenguajes de programación",
        "programmingLanguagesText": "Soy consciente de que existen otros lenguajes especializados, como Kotlin, Swift o Dart para desarrollo móvil, así como modernos como Go para sistemas distribuidos. Aunque aún no los he utilizado profesionalmente, me entusiasma seguir aprendiendo y me encantaría profundizar en ellos para ampliar mis capacidades como desarrollador.",
        "frameworks": "Frameworks y bibliotecas",
        "frameworksText": "Estoy seguro de que podría adaptarme fácilmente a entornos basados en otras tecnologías como Laravel, Symfony, .NET o Vue.js, ya que disfruto el reto de aprender y enfrentarme a nuevas herramientas.",
        "dataBases": "Bases de datos",
        "tools": "Herramientas y tecnologías",
        "styles": "Estilos / UI",
        "softSkills": "Habilidades Blandas"
    }
}